test.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-10-09 Mon 12:24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guru Ashtakam</title>
<meta name="author" content="Akhil Pratap Singh" />
<meta name="generator" content="org mode" />
<meta name="theme-color" content="#77aa99" />
<meta property="og:type" content="article" />
<meta property="og:title" content="Guru Ashtakam" />
<meta property="og:image" content="https://tecosaur.com/resources/org/nib.png" />
<meta property="og:image:type" content="image/png" />
<meta property="og:image:width" content="200" />
<meta property="og:image:height" content="200" />
<meta property="og:image:alt" content="Green fountain pen nib" />
<meta property="og:article:author:first_name" content="Akhil" />
<meta property="og:article:author:last_name" content="Pratap" />
<meta property="og:article:published_time" content="2023-10-09T12:23:20+0530" />
<meta property="og:article:modified_time" content="2023-10-09T12:23:20+0530" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<input type='checkbox' id='theme-switch'><div id='page'><label id='switch-label' for='theme-switch'></label><div id="content">
<header class="page-header"><div class="page-meta">, Akhil Pratap Singh</div>

<h1 class="title">Guru Ashtakam</h1>
</header><nav id="table-of-contents">
<h2><a href="#" style="color:inherit; text-decoration: none;">Table of Contents</a></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#guru-ashtakam">1. Guru Ashtakam</a></li>
<li><a href="#description">2. Description</a></li>
<li><a href="#glory-of-a-guru">3. Glory of a Guru</a></li>
</ul>
</div>
</nav>
<p>
#+date : 2022-12-02
</p>

<div id="outline-container-guru-ashtakam" class="outline-2">
<h2 id="guru-ashtakam"><span class="section-number-2">1.</span> Guru Ashtakam<a aria-hidden="true" href="#guru-ashtakam">#</a> </h2>
<div class="outline-text-2" id="text-guru-ashtakam">
<p>
<a href="https://shlokam.org/wp-content/uploads/2020/11/Guru-Ashtakam-audio.mp3">https://shlokam.org/wp-content/uploads/2020/11/Guru-Ashtakam-audio.mp3</a>
</p>


<p>
<b>शरीरं सुरूपं तथा वा कलत्रं यशश्र्चारु चित्रं धनं मेरुतुल्यं |</b>
<b>गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं ||1|</b>
</p>


<p>
<b>कलत्रं धनं पुत्रपौत्रादि सर्वं गृहं बान्धवाः सर्वमेतद्धि जातम् |</b>
<b>गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं ||2||</b>
</p>

<p>
Wife, wealth, sons, grandsons and all such; home and kindred; all these things maybe there; yet if one&rsquo;s mind be not centered upon the lotus feet of the Guru, what then, what then, what then?
</p>


<p>
<b>षडङ्गादिवेदो मुखे शास्त्रविद्या कवित्वादि गद्यं सुपद्यं करोति |</b>
<b>गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं || 3||</b>
</p>

<p>
The Vedas with their six limbs and the knowledge of all sciences may be on one&rsquo;s lips; one may possess the poetic gift and may compose fine prose and poetry; yet if one&rsquo;s mind be not centred upon the lotus feet of the Guru, what then, what then, what then?
</p>


<p>
<b>विदेशेषु मान्यः स्वदेशेषु धन्यः सदाचारवृत्तेषु मत्तो न चान्यः |</b>
<b>गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं ||4||</b>
</p>

<p>
“I am honoured in other lands and I am prosperous in my homeland; in the paths of righteous conduct there is none who surpasses me”, thus one may think; yet if one&rsquo;s mind be not centred upon the lotus feet of the Guru, what then, what then, what then?
</p>

<p>
<b>क्षमामण्डले भूपभूपालवृन्दैः सदासेवितं यस्य पादारविन्दं |</b>
<b>गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं ||5||</b>
</p>

<p>
One may be constantly extolled and one&rsquo;s presence highly honoured by hosts of emperors and rulers of this world; yet if one&rsquo;s mind be not centred upon the lotus feet of the Guru, what then, what then, what then?
</p>


<p>
<b>यशो मे गतं दिक्षु दानप्रतापा जगद्वस्तु सर्वं करे यत्प्रसादात् |</b>
गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं || 6||
</p>

<p>
“My repute has travelled in all directions through my philanthropy and prowess; all the things of this world are in my hands as rewards for my virtues”, yet if one&rsquo;s mind be not centred upon the lotus feet of the Guru, what then, what then, what then?
</p>


<p>
<b>न भोगे न योगे न वा वाजिराजौ न कान्तामुखे नैव वित्तेषु चित्तं |</b>
गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं ||7||
</p>

<p>
The mind may have turned away from external delights through dispassion and from attainments like Yoga and meditation, possessions like horses and the like, the enchanting face of the beloved, in short, the entire wealth of the earth; yet if one&rsquo;s mind be not centred upon the lotus feet of the Guru, what then, what then, what then?
</p>


<p>
<b>अरण्ये न वा स्वस्य गेहे न कार्ये न देहे मनो वर्तते मे त्वनर्घ्ये |</b>
<b>गुरोरङ्घ्रिपद्मे मनश्र्चेन लग्नं ततः किं ततः किं ततः किं ततः किं ||8||</b>
</p>

<p>
The mind may have lost its charm to live in forests, and likewise in the house; may have lost all desire to achieve whatever; even the concern for the body&rsquo;s welfare may have been outlived; yet if one&rsquo;s mind be not centred upon the lotus feet of the Guru, what then, what then, what then?
</p>
</div>
</div>

<div id="outline-container-description" class="outline-2">
<h2 id="description"><span class="section-number-2">2.</span> Description<a aria-hidden="true" href="#description">#</a> </h2>
<div class="outline-text-2" id="text-2">
<p>
Guru Ashtakam beautifully exemplifies the necessity of a Guru, beseeching the spiritual seeker to bow down to the Lotus Feet of the Guru. Composed by Sri Adi Shankaracharya. GuruAshtakam is an octet in the praise of spiritual Guru, composed by Adi Sankaracharya. Originally, Adi Shankara has written this in praise of his Guru Govinda Pada. He emphasizes that without deep devotion to the spiritual teacher, all our attainments are meaningless.
In Hinduism, a Guru is a spiritual teacher who imparts the higher knowledge of the Vedas and the way of achieving liberation (enlightenment). But mere study of books cannot make one a Guru. One who has studied the Vedas, and who has direct knowledge of Atman (soul) through self-realization can only be enrolled as a Guru. A Guru is knowledgeable, self-realized, liberated, chaste, virtuous, austere, truthful, detached, free from lust and delusion, and dedicated and devoted to God. <b>A Guru is the knower of Brahman.</b> A Guru is God in human form. The words of a Guru are like the words of God.
</p>

<p>
<a href="https://shlokam.org/gurubrahma/">A popular Hindu prayer declares</a>, “The Guru is Brahma, the Guru is Vishnu, the Guru is Shiva, the Guru is verily the Supreme Absolute itself. To that Guru, I offer my salutations.”
</p>

<p>
Paying respects to a Guru, touching the feet of a Guru, serving the Guru and taking care of his personal needs, praising and appreciating a Guru, seeking the blessings of a Guru, remembering and meditating on the name of a Guru, are the parts of Hindu spiritual traditions. But it doesn&rsquo;t insist that everyone should have a Guru in physical form. In Hinduism, there is a provision to consider a sacred scripture, a deity or our very Self as our guide and Guru and develop a mental and intuitive connection with them. With the help of concentration, austerities and self-purification, we can strengthen our faith in our personal Guru of the subtle realm and seek his help either to introduce us to a real Guru, or lead us towards light, knowledge and immortality.
</p>
</div>
</div>

<div id="outline-container-glory-of-a-guru" class="outline-2">
<h2 id="glory-of-a-guru"><span class="section-number-2">3.</span> Glory of a Guru<a aria-hidden="true" href="#glory-of-a-guru">#</a> </h2>
<div class="outline-text-2" id="text-glory-of-a-guru">
<p>
According to the Vedas, Lord Vishnu imparted teachings to the sages in ancient times. Starting from the beginning, Lord Vishnu taught Lord Brahma, who in turn taught Sage Vyasa, who in turn taught Sage Shuka; a succession of Gurus and disciples has proceeded down through the ages through Shri Shankaracharya to the present. A Guru is absolutely necessary for every aspirant in the spiritual path. God is the goal, whereas Guru is the path.
</p>

<p>
All great ones had their teachers. All the sages, saints, prophets, world-teachers, incarnations, great men, however great they might have been, had their own Gurus. Shvetaketu learnt the nature of Truth from Uddalaka, Maitreyi from Yagnavalkya, Bhirgu from Varuna, Narada from Sanatkumara, Nachiketas from Yama, Indra from Prajapati; and several others humbly went to the wise ones, observed strict brahmacharya, practiced rigorous discipline and learnt the science of God from them. Even the incarnation of Lord himself, like Lord Krishna, sat at the feet of his Guru Sandeepani. Lord Rama had Guru Vasishtha, Lord Hanuman had Guru Surya (the Sun God). The Devas (celestial beings) have Brihaspati as their Guru, and even the greatest among the divine beings sat at the feet of Guru Dakshinamurti.
</p>

<p>
The scriptures are like a forest. There are ambiguous passages. There are passages that are apparently contradictory. There are passages that have esoteric meanings, diverse significance, and hidden explanations. There are cross-references. One is in need of a Guru or a preceptor who will explain to him the right meaning, who will remove doubts and ambiguities, and who will place before him the essence of the teachings.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akhil Pratap Singh</p>
<p class="date">Created: 2023-10-09 Mon 12:24</p>
</div>
</div>
</body>
</html>
